Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_and_work/short_term_enterprise_allowance.html.txt.tmx
Source language: en
Languages: ga

source: The Short-Term Enterprise Allowance (STEA) gives support to people who have lost their job and want to start their own business
ga: Soláthraíonn an Liúntas Fiontraíochta Gearrthréimhseach (LFG) tacaíocht do dhaoine atá tar éis a bpost a chailleadh agus atá ag iarraidh a ngnó féin a thosú

source: To qualify you must be getting Jobseeker’s Benefit
ga: Chun a bheith i dteideal na híocaíochta seo, ní mór duit a bheith ag fáil Shochar Cuardaitheora Poist

source: There is no qualifying period, which means you do not need to have been getting Jobseeker’s Benefit for a certain period of time
ga: Níl aon tréimhse cháilitheach, rud a chiallaíonn nach bhfuil ort a bheith ag fáil Shochar Cuardaitheora Poist ar feadh tréimhse ar leith

source: However, you will not qualify if you are getting Jobseeker’s Benefit and working part-time
ga: Ach, ní bheidh tú i dteideal na híocaíochta seo má tá tú ag fáil Shochar Cuardaitheora Poist agus ag obair go páirtaimseartha

source: The Short-Term Enterprise Allowance is paid instead of your Jobseeker’s Benefit for a maximum of 9 months
ga: An Liúntas Fiontraíochta Gearrthréimhseach íoctha uait in áit do Shochar Cuardaitheora Poist ar feadh uasmhéid de 9 mí

source: It ends when your entitlement to Jobseeker's Benefit ends (that is at either 9 or 6 months)
ga: Críochnaíonn sé nuair a thagann deireadh le do theidlíocht do Shochar Cuardaitheora Poist (is é sin ag ceachtar 9 nó 6 mhí)

source: To qualify for the Short-Term Enterprise Allowance you must be getting or have an entitlement to Jobseeker’s Benefit
ga: Chun a bheith i dteideal Liúntas Fiontraíochta Gearrthréimhseach ní mór duit a bheith ag fáil nó a bheith i dteideal Shochar Cuardaitheora Poist

source: Your business plan must be approved in advance in writing by a Case Officer based in an Intreo Centre or a social welfare local office or an Enterprise Officer in your local development company (also known as partnership company) (see 'How to apply' below)
ga: Faomhadh roimh ré i scríbhinn ag Oifigeach Cáis in oifig leasa shóisialaigh áitiúil/ionad Intreo nó do Chuideachta Forbartha Comhtháite Áitiúla (ILDC)/Chuideachta Páirtíochta má tá cónaí ort i gceantar Páirtíochta nó ILDC

source: You must contact the Department of Social Protection immediately if your self-employment ends or you take up employment
ga: Ní bheidh fostaíocht shéasúrach, shealadach nó féin-fhostaíocht pháirt-aimseartha i dteideal Liúntas Fiontraíochta Gearrthréimhseach

source: If you are unemployed when your entitlement to STEA ends you will not immediately re-qualify for Jobseeker’s Benefit. However, you can apply for Jobseeker’s Allowance, which is a means-tested payment
ga: Ní mór duit teagmháil la dhéanamh leis an Roinn Coimirce Sóisialaí láithreach má thagann deireadh le d'fhéin-fhostaíocht nó má ghlacann tú le post

source: Employment grants from a Local Enterprise Office (LEO) or a local development company do not affect your entitlement to the Short-Term Enterprise Allowance
ga: Ní bheidh tionchar ag deontais fhostaíochta ó Oifigí Fiontair Áitiúla nó ó Chuideachta Forbartha Comhtháite Áitiúla ar do theideal Liúntas Fiontraíochta Gearrthréimhseach

source: Help with starting a business
ga: Cabhair ag tosú gnó

source: These supports are provided under a scheme called the Enterprise Support Grant (ESG)
ga: Is féidir leat tuilleadh eolais a fháil maidir le ag éirí fhéinfhostaithe agus ag tosú ghnó

source: Note that you do not have an automatic right to any of these amounts. The Department of Social Protection's Case Officer will assess your application and eligibility
ga: Má tá tú i dteideal, tógfaidh an Liúntas Fiontraíochta Gearrthréimhseach áit do Shochar Cuardaitheora Poist

source: Some items are not eligible for grant support under the ESG. These include:
ga: Íocfar an Liúntas Fiontraíochta Gearrthréimhseach ag an ráta céanna le do Shochar Cuardaitheora Poist, lena n-áirítear aon ardú do dhuine fásta nó páiste cleithiúnach

source: You can get more information about becoming self-employed and setting up a business
ga: Beidh sé críochnaithe nuair a thagann deireadh le do theideal Shochar Cuardaitheora Poist

source: If you qualify, the Short-Term Enterprise Allowance replaces your Jobseeker’s Benefit. The STEA will be paid at the same rate as your Jobseeker’s Benefit, including any increases for adult and child dependants
ga: D’fhéadfadh an Liúntas Fiontraíochta Gearrthréimhseach a íoc díreach isteach chuig do chuntas bainc nó do chuntas chumann foirgníochta ar bhonn seachtainiúil

source: It cannot be paid into a mortgage account
ga: Ní féidir é a íoc isteach i gcuntas morgáiste

source: However the STEA is subject to income tax in the same way as Jobseeker’s Benefit. (Note that this is different from the Back to Work Enterprise Allowance which is not taxable)
ga: Tá an Liúntas Cuardaitheora Poist faoi réir cháin ioncaim ar an mbealach céanna is atá Sochar Cuardaitheora Poist

source: You may qualify for Start Your Own Business Relief which provides a two-year exemption from income tax (up to a maximum of €40,000 each year) for people who have been unemployed for at least 12 months before starting their own business
ga: Soláthraíonn an scéim Do Chuid Gnó a Chur ar Bun (SYOB) faoiseamh cánach do dhaoine atá dífhostaithe ar feadh 12 mhí ar a laghad, ag fáil íocaíocht leasa shóisialaigh agus atá ag cur gnó incháilithe ar bun

source: It runs from 25 October 2013 to 31 December 2018. (However if you started to get the STEA before 25 October 2013 you do not qualify for the relief because you had already started your business before the start date for the scheme.)
ga: Ritheann an scéim ó 25 Deireadh Fómhair 2013 go 31 Nollaig 2018 agus soláthraíonn sé díolúine ó ioncam cánach ar feadh 2 bhliain (suas go dtí uasmhéid €40,000 sa bhliain) do dhaoine atá dífhostaithe ar feadh 12 mhí ar a laghad sula gcuirfidh siad a gcuid gnó ar bun

source: You can keep any extra (or secondary benefits) that you were getting with your Jobseeker’s Benefit provided you continue to satisfy the conditions
ga: Coinneoidh tú aon teideal atá agat do bhuntáistí tánaisteacha a bhí á bhfáil agat le do Shochar Cuardaitheora Poist chomh fada agus a leanann tú ar aghaidh ag sásamh na gcoinníollacha

source: For example, a medical card and Back to School Clothing and Footwear Allowance
ga: Mar shampla, cárta leighis agus Liúntas Éadaí agus Coisbhirt don Scoilbhliain Nua

source: However you must be deemed eligible for the Rental Accomodation Scheme to keep your Rent Supplement and an increase in your income may affect your Rent Supplement
ga: Ach, seans go mbeidh tionchar ag méadú ar d’ioncam ar d'Fhorlíonadh Cíosa nó d'Fhorlíonadh Ús Morgáiste

source: To find out how your Rent Supplement may be affected contact the Department of Social Protection's representative (formerly known as the Community Welfare Officer) in your local health centre
ga: Chun a fháil amach cén chaoi a d’fhéadadh tionchar a bheith aige seo ar d’Fhorlíonadh Cíosa déan teagmháil le d’Oifigeach Leasa Pobail áitiúil

source: To apply for the Short-Term Enterprise Allowance, complete application form STEA 1 (pdf)
ga: Chun iarratas a dhéanamh ar an Liúntas Fiontraíochta Gearrthréimhseach, líon isteach foirm iarratais STEA 1 (pdf)

source: If you live in an area covered by a local development company (LDC) you should return form STEA 1 to the Enterprise Officer
ga: Má tá cónaí ort i gceantar atá clúdaithe ag Cuideachta Forbartha Comhtháite Áitiúil (LDC) nó Cuideachta Páirtíochta Áitiúil ba cheart duit an fhoirm STEA 1 a sheoladh ar ais chuig an Oifigeach Fiontraíochta i do Pháirtíocht Áitiúil nó ILDC

source: If you do not live in a LDC area, you should return form STEA 1 to the Case Officer in your local Intreo centre or social welfare local office
ga: Mura bhfuil cónaí ort i LDC, ba cheart duit an fhoirm STEA 1 a sheoladh ar ais chuig an Áisitheoir Post i d’oifig leasa shóisialaigh áitiúla ó ionad Intreo

source: The Enterprise Officer or Case Officer will look at your business proposal and may discuss certain aspects of it with you
ga: Breathnóidh an tOifigeach Fiontraíochta nó an tOifigeach Cáis ar do thogra gnó agus seans go bpléifidh sé/sí gnéithe áirithe de leat

source: You must not take up self-employment until you get written approval from the LDC or Department of Social Protection
ga: Ní féidir leat tús a chur le féin-fhostaíocht go dtí go bhfaigheann tú faomhadh i scríbhinn ón LDC nó ón Roinn Coimirce Sóisialta

source: If you are accepted on to the Short-Term Enterprise Allowance, you must register as self-employed with the Revenue Commissioners. You can find more information on self-employment from your local tax office
ga: Má ghlactar leat ar an Liúntas Fiontraíochta Gearrthréimhseach, ní mór duit clárú mar dhuine féinfhostaithe leis na Coimisinéirí Ioncaim

source: If you live in an area covered by a local development company (pdf) , you should apply to the Enterprise Officer
ga: Má tá cónaí ort i gceantar atá clúdaithe ag Cuideachta Páirtíochta Áitiúil nó Cuideachta Forbartha Comhtháite Áitiúil (LDC) (pdf), ba cheart duit iarratas a dhéanamh chuig an Oifigeach Fiontraíochta i do Pháirtíocht Áitiúil nó ILDC

source: If you do not live in an LDC area, you should apply to the Jobs Case Officer in your Intreo centre or social welfare local office
ga: Mura bhfuil cónaí ort i gCeantar Páirtíochta/ILDC, ba cheart duit iarratas a dhéanamh chuig an Oifigeach Cáis i d’ionad Intreo ó oifig leasa shóisialaigh áitiúla
